{
    "blogs":[
        {
            "title": "Thirsty Suitors Review",
            "body": "Thirsty Suitors is a lot of things. It's beautiful, yet crude. It has attitude while being heartfelt. It's satirical but honest. Thirsty Suitors is a vibe. /nLet's start with the elements that you'll immediately notice upon first boot: the style and tone. Thirsty Suitors looks truly unique in a sea of cel-shaded, cartoony indies. All the textures have this hand-painted feel to them that harmonizes amazingly in scenes such as the kitchen or the diner. Battles are dazzling to look at with extremely flashy, yet clean VFX and absurdly over-the-top animations. My eyes were particularly glued to the screen during the theatrical feuds against Jala's exes. The sauce that really accentuates Thirsty Suitor's style is the character writing. Dialogue is pointed and witty. I had a lot of trouble choosing between dialogue options because usually I genuinely wanted to choose all 3 choices presented to me. And it's not just Jala who is a joy to listen to. There's a surprising amount of side characters and, wow, THESE are truly characters.You can immediately tell who's voice is talking by just the tone of their writing. None of the cast feels half-assed or even close to boring. Jala's Dad and Auntie Chandra are amazing characters and I was dying to hear more dialogue from them.There was a lot thought put into everyone's caricature-like personality and motivations. I really love how major the ethnicities, backgrounds, and cultures of the characters are. The queer characters were absolutely some of my favorite representations in any game or even media in general. /n Sadly, the interwoven dialogue and creative animations don't entirely carry combat. There are some interesting systems at play with the player having to study a character's weaknesses and applying debuffs accordingly but I feel like there could have been a bit more risk/reward options to choose from. After finding what an enemy is weak to, all battles basically devolve into the same patterns: use all your mana as you can, use items to restore mana, rinse and repeat. Luckily the game's short runtime made these issues not really detract from the experience too much. I was more there for the drama and plot and I imagine most other players interested in this type of title would agree with me. It's passable but the design of combat is absolutely an area Thirsty Suitors could have used some more love in. /n And then of course there's the skating. I really don't know how to feel about the skating. The mechanics are rock solid and you can tell the team put a lot of love into it. I relished my time skating around the world to navigate but at times I felt like there should have been an option to mount/dismount the skateboard. In more open areas like the town and the skate park, you are automatically on your skateboard BUT there are of course people and places and POIs that you have to interact with so the skating has to be toned down to a pretty slow pace. I could easily imagine a world where I could hop on a super quick version of the skateboard to go from point A to point B and then hop off when I get there. Dismounting would also help when I accidentally steered myself in a janky corner and struggled with the vehicle-like controls to turn myself around. Additionally, I never really felt tempted to interact with the skate challenges. When the game forced me to, I had a good time but the rewards presented didn't really tempt me to dive in when it was optional. I think upping the general pace of skating while zooming out the camera a bit would have really done a lot to benefit the skating gameplay. To sum it up, don't force the skating to serve two purposes and lean into what making skating fun. /n Lastly, I wanna touch on the narrative. Vague spoilers ahead so skip this paragraph if you wanna avoid those. Thirsty Suitors revolves around a young adult, Jala, that is lost and has nowhere to turn than returning home to her parents. She utterly annihilated almost all her ties to the small, cute, logging town of Timber Hills. Jala must painstakingly and embarrassingly repair her relationships with her exes, her family, and most importantly her toxic internal monologue. I adored how all the character conflicts don't magically get resolved. They more so get to a point where their relationship is neutral with the promise of both parties working to get better. This felt awfully grounded in comparison to the fantastical and bombastic depictions of said conflicts. I think it's playing off of how, when we feel we hit rock bottom, everything feels so evil and out to get you, but in reality it's usually you're own brain catastrophizing things. Mature and honest communication can go a long way even when you think a bridge has been burned! /n Overall, Thirsty Suitors is a tough game to score. It's a game of supremely delightful highs and pretty underwhelming lows. For a player like me, I love Thirsty Suitors for it's lofty ambitions, charming style, and distinct voice. I'd rather have more of this type of experience than generic, uninspired, trend-chasers. I'm super excited to see what Outer Loop does next.",
            "author" : "reid",
            "id" : 1
        },
        {
            "title" : "Sea of Stars Review",
            "body" : "Sea of Stars is a fine game that could have been an excellent game. The first few honeymoon hours of the game were bliss but as I started uncovering the deep rooted issues as the hours went on, I soured on the game rapidly./n Firstly, I wanna state that I'm not a JRPG person. I grew up playing the GBA and DS Pokemon games so the genre holds some nostalgia for me but I have little to no interested in modern JRPGs. Sea of Stars seemed like something that could be right up my ally: gorgeous pixel art combined with tropey old JRPG sensibilities but with modern improvements. And to be fair most of that statement it nails but sadly it's glued together with repetitive combat and writing that absolutely did not work. /n Let's start with that combat because it was one of the parts I was the hottest on in the beginning hours and the Demo I had played a few months ago. I think the bones of this system is pretty solid but it just does nothing to grow in complexity after the initial tutorial and onboarding. I love, love, love the lock system where enemies can have their attacks canceled if you use the right combination of attacks on them. I think they could have expanded that immensely as the game went onward but after you have a handful of companions, it remains static. Would have loved some added depths to flex my strategy muscles but instead combat lands a good bit UNDER the complexity of Pokemon. I really do think a few subtle system changes and more complex encounter design in the mid to late game could have really gone a long way. The bosses however are an exception to this and I always found them extremely fun to fight up to somewhat-disappointing-but-still-pretty-cool final boss. /n By far my biggest issue with the game is the writing. I think the general plot is decent enough. It hits pretty much every fantasy location you can think of and the pacing is nice and quick. I cannot say the same about the character writing. These characters are just some of the most boring motherfuckers I've ever heard speak in a video game. They're one-note, annoying, and forgettable. My partner asked me about the two protagonists when I was playing on the TV and I struggled to remember their names or even tell her anything of substance about them. I felt embarrassed, like I hadn't paid attention enough but then I realized there really isn't anything to them. They are blank slates even though the player has no choices which feels like the worst of both worlds. The side characters are all very flat: what you see if what you get. Badass assassin who doesn't talk much, comic relief bumbling sidekick, slime creature who is more eloquent than you'd think, and whimsical old potion guy. These are all well-walked paths for RPG characters and there's hardly any deviation from what you'd expect. What kills me if that the design of the party is so amazing. The traversal and battle animations FLOORED me pretty much up to the very end. There is such potential in these sprites and it's so sad to see basically none of it delivered upon. The biggest swing with the characters is what they attempt with Garl and, respectfully, I fucking hated him. He acts as a mouthpiece for the player and the protagonists the whole game. He keep the plot moving forward but his motivations are the generic I like to help people hehe. He's wholesome and self-less to an extreme extent to where my expectation was that we was gonna heel-turn or have any sort of character development. Spoilers: He does not. He dies by sacrificing himself and then his ghost bosses you around for the rest of the game. I am ALL about wholesome games or wholesome characters but his characterization just felt like a mouth full of candy that you then pour sugar into. ANY bit of salt or spice would make him more interesting. Ughhhhh okay I'm done ranting but it's just so sad to see the artists creations literally become LESS interesting whenever they speak. /n I wanna touch on some positives though because ultimately I did enjoy this game. There is a LOT of good here. I really loved the level design and the pacing of the areas you explore. I think the different traversal techniques feel super kinetic, especially the grappling hook. There's also a good few simple puzzles in the world are in a great sweet spot in terms of difficulty and time of execution. Then of course we MUST talk about this art. It's jaw-dropping. I wanna give the artists all a big, juicy smooch for all the work they did because this game looks so damn good. The style of everything is spot on and super consistent. Environments pop and the music underscores such a vibe with every area you explore. The character animations are wildly polished and I wanna shout out two in particular: The slime companion you get late in the game named B'st and the ghost pirate boss you fight in the early game called Stormcaller. You'd be hard-pressed to find better pixel art in any game that what Sea of Stars showcases. /n When I got the credits of Sea of Stars, I felt awfully validated when I was reading the roles of the team. Sabotage is overwhelmingly artists and engineers with a few designers and one writer. This is a 6/10 that could have easily been a 9 in another life. I think the team should be extremely proud of what they made and carry on some big lessons moving into their next project.",
            "author" : "reid",
            "id" : 2
        }
    ]
}